tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"

brew "bat"
brew "cloc"
brew "cowsay"
brew "duf"
brew "dust"
brew "fd"
brew "fish"
brew "python@3.9"
brew "fx"
brew "fzf"
brew "glib"
brew "gnupg"
brew "go"
brew "goenv", args: ["HEAD"]
brew "grep"
brew "grpcui"
brew "grpcurl"
brew "htop"
brew "jenv"
brew "jq"
brew "lazygit"
brew "llvm"
brew "mas"
brew "openjdk"
brew "maven"
brew "ninja"
brew "meson"
brew "midnight-commander"
brew "neovim", args: ["HEAD"]
brew "newsboat"
brew "tree"
brew "pass"
brew "pass-otp"
brew "pipenv"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rustup-init"
brew "scc"
brew "snownews"
brew "speedtest-cli"
brew "starship"
brew "tfenv"
brew "tig"
brew "tokei"
brew "vim"
brew "w3m"
brew "watch"
brew "wget"
brew "yq"
brew "railwaycat/emacsmacport/emacs-mac"

cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "keepingyouawake"
cask "keybase"
cask "microsoft-remote-desktop"
cask "spotify"
cask "telegram"
cask "zoom"

mas "AdGuard for Safari", id: 1440147259
mas "Xcode", id: 497799835
